performance.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Phase 1"
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-type: application/json
scenarios:
  - flow:
      - get:
          url: "/rest/v1/tasks"
      - post:
          url: "/rest/v1/tasks"
          json:
            content: "Tasktareita"
          capture:
           json: "$.id"
           as: "id"
      - log: "Current id is {{ id }}"
      - get:
          url: "/rest/v1/task/{{ id }}"
      - post:
          url: "/rest/v1/tasks/{{ id }}"
          json:
            content: "TasktareotaAAA"
      - post:
          url: "/rest/v1/tasks/{{ id }}/close"
      - post:
          url: "/rest/v1/tasks/{{ id }}/reopen"
      - delete:
          url: "/rest/v1/tasks/{{ id }}"


  # For more information: https://artillery.io/docs/script-reference/
# For more information: https://artillery.io/docs/script-reference/